### [DataFrame 연산 - 3 ]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [1]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np      # 빈칸 의미하는 표현법 사용 목적

In [2]:
# [2] 데이터 준비
data={'A':[98, 78, np.nan, 99],
      'B':[78, 56, 85, 45]}

In [3]:
# [3] dict -> df
DF1=pd.DataFrame(data)
DF1

      A   B
0  98.0  78
1  78.0  56
2   NaN  85
3  99.0  45

In [5]:
# [4] 연산수행
# DataFrame + int
DF1.add(5,fill_value=0)

       A   B
0  103.0  83
1   83.0  61
2    5.0  90
3  104.0  50

In [9]:
# DataFrame + DataFrame  
# 둘 다 같은 자리에 nan이 있으면 fill_value 해도 무조건 nan 반환
# 두개 중 하나라도 값이 있다면 fill_value 사용해서 계산 가능
DF1.add(DF1+10, axis=1)

       A    B
0  206.0  166
1  166.0  122
2    NaN  180
3  208.0  100

In [10]:
DF2 = pd.DataFrame({'A':[98, 78, 20, 99],
      'B':[78, 56, 85, 45]})
DF2

    A   B
0  98  78
1  78  56
2  20  85
3  99  45

In [11]:
DF1.add(DF2,fill_value=0)

       A    B
0  196.0  156
1  156.0  112
2   20.0  170
3  198.0   90